FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Hxx/stm32hxx_hal_eth.h
/**
  ******************************************************************************
  * @file    stm32hxx_hal_eth.h
  * @author  MCD Application Team
  * @brief   Header file of ETH HAL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */ 

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32Hxx_HAL_ETH_H
#define STM32Hxx_HAL_ETH_H

#define STM32H7xx_HAL_ETH_H

#ifdef __cplusplus
 extern "C" {
#endif


/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal_def.h"

#if defined(ETH)

/** @addtogroup STM32H7xx_HAL_Driver
  * @{
  */

/** @addtogroup ETH
  * @{
  */ 

/* Exported types ------------------------------------------------------------*/
#ifndef ETH_TX_DESC_CNT
 #error Please define ETH_TX_DESC_CNT in your stm32h7xx_hal_conf.h
#endif
	 
#ifndef ETH_RX_DESC_CNT
 #error Please define ETH_RX_DESC_CNT in your stm32h7xx_hal_conf.h
#endif

/*********************** Descriptors struct def section ************************/
/** @defgroup ETH_Exported_Types ETH Exported Types
  * @{
  */
struct xErrorFields {
	uint16_t
		ERR_IHE       : 1,  /* IP Header Error */
		ERR_DB        : 1,  /* Deferred Bit */
		ERR_Umderflow : 1,  /* Underflow Error */
		ERR_ExcDefer  : 1,  /* Excessive Deferral */
		ERR_CC        : 4,  /* Collision count. */
		ERR_EC        : 1,  /* Excessive Collision */
		ERR_LC        : 1,  /* Late collision. */
		ERR_NC        : 1,  /* No carrier. */
		ERR_LoC       : 1,  /* Loss of Carrier: carrier lost during transmission */
		ERR_PCE       : 1,  /* Payload Checksum Error */
		ERR_FF        : 1,  /* Packet Flushed: DMA/MTL flushed the packet due to SW flush */
		ERR_JT        : 1,  /* Jabber Timeout */
		ERR_SUMMARY   : 1;
} __attribute__( (packed) );;
/** 
  * @brief  ETH DMA Descriptor structure definition
  */
typedef struct
{
	union
	{
  __IO uint32_t DESC0;	// The buffer
		uint32_t Buffer_1____;
	};
	union
	{
  __IO uint32_t DESC1;
		uint32_t Buffer_2____;
	};
	union
	{
  __IO uint32_t DESC2;  // Buffer 1 length (0x00003FFFU) Buffer 2 Length (0x3FFF0000)
		struct
		{
			unsigned
				Buff1_Length : 14,	// Buffer 1 Length
				VTIR________ : 2,			// VLAN Tag Insertion or Replacement mask
				Buff2_Length : 14,	// Buffer 2 Length
				TTSE________ : 1,			// Transmit Timestamp Enable
				IOC_________ : 1;			// Interrupt on Completion
		};
	};
	union
	{
  __IO uint32_t DESC3;	// bit 31 is the OWN (by DMA) bit
		struct
		{
			struct xErrorFields ERR_FIELDS;
			struct
			{
			uint16_t

				Reserved_1__ : 1,
				TIMESTAMP___ : 1,  /*!< Tx Timestamp Status */
				Reserved_3__ : 10,
				LAST_DESC___ : 1,  /*!< Last Descriptor */
				FIRST_DESC__ : 1,  /*!< First Descriptor */
				STATUS_CTX__ : 1,  /*!< Context Type */
				OWN_________ : 1;
			} __attribute__( (packed) );
		};
	};
  uint32_t BackupAddr0; /* used to store rx buffer 1 address */
  uint32_t BackupAddr1; /* used to store rx buffer 2 address */
}ETH_DMADescTypeDef;

/*
 * Channel status register ( see field DMACSR, or "ETH_DMACSR".
 */
typedef struct {
	union
	{
		uint32_t ulValue;
		struct
		{
			uint32_t
				TI_Transmit_Interrupt__________ : 1,
				TPS_Transmit_Process_Stopped___ : 1,
				TBU_Transmit_Buffer_Unavailable : 1,
				R_0 : 3,
				RI_Receive_Interrupt___________ : 1,
				RBU_Receive_Buffer_Unavailable_ : 1,
				RPS_Receive_Process_Stopped____ : 1,
				RWT_Receive_Watchdog_Timeout___ : 1,
				ETI_Early_Transmit_Interrupt___ : 1,
				ERI_Early_Receive_Interrupt____ : 1,
				FBE_Fatal_Bus_Error____________ : 1,
				CDE_Context_Descriptor_Error___ : 1,
				AIS_Abnormal_Interrupt_Summary_ : 1,
				NIS_Normal_Interrupt_Summary___ : 1,

				REB_0_Error_during_read_transfer_when_1__________ : 1,
				REB_1_Error_during_descriptor_access_when_1______ : 1,
				REB_2_Error_during_data_transfer_by_Rx_DMA_when_1 : 1,

				TEB_0_Error_during_read_transfer_when_1__________ : 1,
				TEB_1_Error_during_descriptor_access_when_1______ : 1,
				TEB_2_Error_during_data_transfer_by_Tx_DMA_when_1 : 1,

				R_1 : 10;
		};
	};
} IntStatus_t;

/** 
  * 
  */

/** 
  * @brief  ETH Buffers List structure definition
  */
typedef struct __ETH_BufferTypeDef
{
  uint8_t *buffer;                /*<! buffer address */
  
  uint32_t len;                   /*<! buffer length */
  
  struct __ETH_BufferTypeDef *next; /*<! Pointer to the next buffer in the list */	
}ETH_BufferTypeDef;
/** 
  * 
  */
  
/** 
  * @brief  DMA Transmit Descriptors Wrapper structure definition
  */
typedef struct
{
  uint32_t  TxDesc[ETH_TX_DESC_CNT];     /*<! Tx DMA descriptors addresses */
  
  uint32_t  CurTxDesc;               /*<! Current Tx descriptor index for packet transmission */

  uint32_t  TailTxDesc;               /*<! Next TX packet to clean up the buffer */
  
}ETH_TxDescListTypeDef;
/** 
  * 
  */

 /** 
  * @brief  Transmit Packet Configuration structure definition
  */
typedef struct
{
  uint32_t Attributes;              /*!< Tx packet HW features capabilities. 
                                         This parameter can be a combination of @ref ETH_Tx_Packet_Attributes*/
  
  uint32_t Length;                  /*!< Total packet length   */
  
  ETH_BufferTypeDef *TxBuffer;      /*!< Tx buffers pointers */
  
  uint32_t SrcAddrCtrl;             /*!< Specifies the source address insertion control.
                                         This parameter can be a value of @ref ETH_Tx_Packet_Source_Addr_Control */
  
  uint32_t CRCPadCtrl;             /*!< Specifies the CRC and Pad insertion and replacement control. 
                                        This parameter can be a value of @ref ETH_Tx_Packet_CRC_Pad_Control  */
  
  uint32_t ChecksumCtrl;           /*!< Specifies the checksum insertion control. 
                                        This parameter can be a value of @ref ETH_Tx_Packet_Checksum_Control  */
  
  uint32_t MaxSegmentSize;         /*!< Sets TCP maximum segment size only when TCP segmentation is enabled. 
                                        This parameter can be a value from 0x0 to 0x3FFF */
  
  uint32_t PayloadLen;             /*!< Sets Total payload length only when TCP segmentation is enabled.     
                                        This parameter can be a value from 0x0 to 0x3FFFF */
  
  uint32_t TCPHeaderLen;           /*!< Sets TCP header length only when TCP segmentation is enabled.
                                        This parameter can be a value from 0x5 to 0xF */

  uint32_t VlanTag;                /*!< Sets VLAN Tag only when VLAN is enabled. 
                                        This parameter can be a value from 0x0 to 0xFFFF*/
  
  uint32_t VlanCtrl;               /*!< Specifies VLAN Tag insertion control only when VLAN is enabled. 
                                        This parameter can be a value of @ref ETH_Tx_Packet_VLAN_Control */
  
  uint32_t InnerVlanTag;           /*!< Sets Inner VLAN Tag only when Inner VLAN is enabled.
                                        This parameter can be a value from 0x0 to 0x3FFFF */
  
